---
type: ConnectionInputPoint
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 6
tags: [revit-api, class]
---

# ConnectionInputPoint

`Autodesk.Revit.DB.Structure.ConnectionInputPoint` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConnectionInputPoint | — | `` |
| Constructor | ConnectionInputPoint | 2021 | `public ConnectionInputPoint ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Id | 2021 | `public Guid Id { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Point | 2021 | `public XYZ Point { get ; set ; }` |